[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:16:53
   reason?: GuardrailBlockReason;
 }
 
-export const normalize = (value: string): string => {
-  return value
-    .toLowerCase()
-    .normalize('NFD')
-    .replace(/[\u0300-\u036f]/g, '')
-    .replace(/\s+/g, ' ')
-    .trim();
-};
+export const normalize = (value: string): string => {};
 
 const INSULT_KEYWORDS = [
killedBy: ChatMessageService input guardrail blocks insults and returns refusal without calling orchestrator
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"context": {"guideLevel": undefined, "location": undefined}, "history": [], "image": undefined, "knowledgeBaseBlock": "", "locale": "en", "museumMode": false, "requestId": "req-1", "text": "You are an idiot", "userMemoryBlock": "", "visitContext": undefined}

[Killed] MethodExpression
modules/chat/application/art-topic-guardrail.ts:17:10
 }
 
 export const normalize = (value: string): string => {
-  return value
-    .toLowerCase()
-    .normalize('NFD')
-    .replace(/[\u0300-\u036f]/g, '')
-    .replace(/\s+/g, ' ')
-    .trim();
+  return value.toLowerCase().normalize('NFD').replace(/[\u0300-\u036f]/g, '').replace(/\s+/g, ' ');
 };
 
killedBy: GuardrailEvaluationService evaluateOutput blocks whitespace-only output as unsafe
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
modules/chat/application/art-topic-guardrail.ts:17:10
 }
 
 export const normalize = (value: string): string => {
-  return value
-    .toLowerCase()
+  return value.toUpperCase()
     .normalize('NFD')
     .replace(/[\u0300-\u036f]/g, '')
killedBy: ChatMessageService input guardrail blocks insults and returns refusal without calling orchestrator
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"context": {"guideLevel": undefined, "location": undefined}, "history": [], "image": undefined, "knowledgeBaseBlock": "", "locale": "en", "museumMode": false, "requestId": "req-1", "text": "You are an idiot", "userMemoryBlock": "", "visitContext": undefined}

[Killed] StringLiteral
modules/chat/application/art-topic-guardrail.ts:19:16
 export const normalize = (value: string): string => {
   return value
     .toLowerCase()
-    .normalize('NFD')
+    .normalize("")
     .replace(/[\u0300-\u036f]/g, '')
     .replace(/\s+/g, ' ')
killedBy: ChatMessageService postMessage validates session ownership and calls orchestrator with correct params
statusReason: RangeError: The normalization form should be one of NFC, NFD, NFKC, NFKD.

[Killed] Regex
modules/chat/application/art-topic-guardrail.ts:21:14
     .toLowerCase()
     .normalize('NFD')
     .replace(/[\u0300-\u036f]/g, '')
-    .replace(/\s+/g, ' ')
+    .replace(/\S+/g, ' ')
     .trim();
 };
killedBy: evaluateUserInputGuardrail blocks insult EN "idiot"
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Object {
-   "allow": false,
-   "reason": "insult",

[Survived] Regex
modules/chat/application/art-topic-guardrail.ts:21:14
     .toLowerCase()
     .normalize('NFD')
     .replace(/[\u0300-\u036f]/g, '')
-    .replace(/\s+/g, ' ')
+    .replace(/\s/g, ' ')
     .trim();
 };

[Survived] ArrayDeclaration
modules/chat/application/art-topic-guardrail.ts:25:25
     .trim();
 };
 
-const INSULT_KEYWORDS = [
-  'idiot',
-  'stupid',
-  'dumb',
-  'moron',
-  'fuck',
-  'shit',
-  'bitch',
-  'asshole',
-  'connard',
-  'con',
-  'salope',
-  'pute',
-  'encule',
-  'fdp',
-  'nique ta mere',
-  'ta gueule',
-];
+const INSULT_KEYWORDS = [];
 
 const INJECTION_PATTERNS = [

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:27:3
 
 const INSULT_KEYWORDS = [
   'idiot',
-  'stupid',
+  "",
   'dumb',
   'moron',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:28:3
 const INSULT_KEYWORDS = [
   'idiot',
   'stupid',
-  'dumb',
+  "",
   'moron',
   'fuck',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:31:3
   'dumb',
   'moron',
   'fuck',
-  'shit',
+  "",
   'bitch',
   'asshole',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:32:3
   'moron',
   'fuck',
   'shit',
-  'bitch',
+  "",
   'asshole',
   'connard',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:35:3
   'bitch',
   'asshole',
   'connard',
-  'con',
+  "",
   'salope',
   'pute',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:37:3
   'connard',
   'con',
   'salope',
-  'pute',
+  "",
   'encule',
   'fdp',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:38:3
   'con',
   'salope',
   'pute',
-  'encule',
+  "",
   'fdp',
   'nique ta mere',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:41:3
   'encule',
   'fdp',
   'nique ta mere',
-  'ta gueule',
+  "",
 ];
 

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:46:3
 
 const INJECTION_PATTERNS = [
   'ignore previous',
-  'ignore all instructions',
+  "",
   'ignore above',
   'ignore the above',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:52:3
   'disregard previous',
   'disregard all',
   'disregard instructions',
-  'ignore les instructions',
+  "",
   'ignore tout ce qui precede',
   'oublie les instructions',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:59:3
   'jailbreak',
   'system prompt',
   'reveal your prompt',
-  'show your instructions',
+  "",
   'print your system',
   'repeat your instructions',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:61:3
   'reveal your prompt',
   'show your instructions',
   'print your system',
-  'repeat your instructions',
+  "",
   'developer mode',
   'mode developpeur',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:62:3
   'show your instructions',
   'print your system',
   'repeat your instructions',
-  'developer mode',
+  "",
   'mode developpeur',
   'contourne les regles',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:63:3
   'print your system',
   'repeat your instructions',
   'developer mode',
-  'mode developpeur',
+  "",
   'contourne les regles',
   'override instructions',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:66:3
   'mode developpeur',
   'contourne les regles',
   'override instructions',
-  'new instructions',
+  "",
   'act as if',
   'pretend you are',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:70:3
   'act as if',
   'pretend you are',
   'you are now',
-  'from now on',
+  "",
   'roleplay as',
   'do anything now',

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:72:3
   'you are now',
   'from now on',
   'roleplay as',
-  'do anything now',
+  "",
   'dan mode',
 ];

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:73:3
   'from now on',
   'roleplay as',
   'do anything now',
-  'dan mode',
+  "",
 ];
 

[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:76:49
   'dan mode',
 ];
 
-const escapeRegExp = (value: string): string => {
-  return value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-};
+const escapeRegExp = (value: string): string => {};
 
 const isCjk = (s: string): boolean => /[\u3000-\u9fff\uf900-\ufaff]/.test(s);
killedBy: ChatMessageService input guardrail blocks prompt injection attempts
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Survived] StringLiteral
modules/chat/application/art-topic-guardrail.ts:77:47
 ];
 
 const escapeRegExp = (value: string): string => {
-  return value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
+  return value.replace(/[.*+?^${}()|[\]\\]/g, "");
 };
 

[Survived] ArrowFunction
modules/chat/application/art-topic-guardrail.ts:80:15
   return value.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
 };
 
-const isCjk = (s: string): boolean => /[\u3000-\u9fff\uf900-\ufaff]/.test(s);
+const isCjk = () => undefined;
 
 const containsKeyword = (normalizedText: string, keyword: string): boolean => {

[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:82:79
 
 const isCjk = (s: string): boolean => /[\u3000-\u9fff\uf900-\ufaff]/.test(s);
 
-const containsKeyword = (normalizedText: string, keyword: string): boolean => {
-  // CJK characters don't have word boundaries — always use includes()
-  if (isCjk(keyword)) {
-    return normalizedText.includes(keyword);
-  }
-
-  if (keyword.includes(' ') || keyword.length <= 3) {
-    const pattern = new RegExp(`(^|\\b)${escapeRegExp(keyword)}(\\b|$)`);
-    return pattern.test(normalizedText);
-  }
-
-  return normalizedText.includes(keyword);
-};
+const containsKeyword = (normalizedText: string, keyword: string): boolean => {};
 
 const includesAny = (normalizedText: string, keywords: string[]): boolean => {
killedBy: ChatMessageService input guardrail blocks insults and returns refusal without calling orchestrator
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"context": {"guideLevel": undefined, "location": undefined}, "history": [], "image": undefined, "knowledgeBaseBlock": "", "locale": "en", "museumMode": false, "requestId": "req-1", "text": "You are an idiot", "userMemoryBlock": "", "visitContext": undefined}

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:84:7
 
 const containsKeyword = (normalizedText: string, keyword: string): boolean => {
   // CJK characters don't have word boundaries — always use includes()
-  if (isCjk(keyword)) {
+  if (true) {
     return normalizedText.includes(keyword);
   }
killedBy: chat service orchestrator error handling returns fallback text when model is null
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "running without an LLM key"
Received string:    "I answer only about art, monuments, museums, architecture, and cultural heritage."

[Survived] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:84:7
 
 const containsKeyword = (normalizedText: string, keyword: string): boolean => {
   // CJK characters don't have word boundaries — always use includes()
-  if (isCjk(keyword)) {
+  if (false) {
     return normalizedText.includes(keyword);
   }

[Killed] EqualityOperator
modules/chat/application/art-topic-guardrail.ts:88:32
     return normalizedText.includes(keyword);
   }
 
-  if (keyword.includes(' ') || keyword.length <= 3) {
+  if (keyword.includes(' ') || keyword.length < 3) {
     const pattern = new RegExp(`(^|\\b)${escapeRegExp(keyword)}(\\b|$)`);
     return pattern.test(normalizedText);
killedBy: chat service orchestrator error handling returns fallback text when model is null
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "running without an LLM key"
Received string:    "I answer only about art, monuments, museums, architecture, and cultural heritage."

[Killed] LogicalOperator
modules/chat/application/art-topic-guardrail.ts:88:7
     return normalizedText.includes(keyword);
   }
 
-  if (keyword.includes(' ') || keyword.length <= 3) {
+  if (keyword.includes(' ') && keyword.length <= 3) {
     const pattern = new RegExp(`(^|\\b)${escapeRegExp(keyword)}(\\b|$)`);
     return pattern.test(normalizedText);
killedBy: chat service orchestrator error handling returns fallback text when model is null
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "running without an LLM key"
Received string:    "I answer only about art, monuments, museums, architecture, and cultural heritage."

[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:96:78
   return normalizedText.includes(keyword);
 };
 
-const includesAny = (normalizedText: string, keywords: string[]): boolean => {
-  return keywords.some((keyword) => containsKeyword(normalizedText, keyword));
-};
+const includesAny = (normalizedText: string, keywords: string[]): boolean => {};
 
 export const hasInsultSignal = (normalizedText: string): boolean => {
killedBy: chat service orchestrator error handling triggers output guardrail on insult in orchestrator response
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ArrowFunction
modules/chat/application/art-topic-guardrail.ts:97:24
 };
 
 const includesAny = (normalizedText: string, keywords: string[]): boolean => {
-  return keywords.some((keyword) => containsKeyword(normalizedText, keyword));
+  return keywords.some(() => undefined);
 };
 
killedBy: ChatMessageService input guardrail blocks insults and returns refusal without calling orchestrator
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"context": {"guideLevel": undefined, "location": undefined}, "history": [], "image": undefined, "knowledgeBaseBlock": "", "locale": "en", "museumMode": false, "requestId": "req-1", "text": "You are an idiot", "userMemoryBlock": "", "visitContext": undefined}

[Killed] MethodExpression
modules/chat/application/art-topic-guardrail.ts:97:10
 };
 
 const includesAny = (normalizedText: string, keywords: string[]): boolean => {
-  return keywords.some((keyword) => containsKeyword(normalizedText, keyword));
+  return keywords.every(keyword => containsKeyword(normalizedText, keyword));
 };
 
killedBy: ChatService.postMessageStream returns refusal immediately when input guardrail blocks
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 9
Received array:  ["This ", "painting ", "by ", "Monet ", "captures ", "the ", "essence ", "of ", "impressionism."]

[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:100:69
   return keywords.some((keyword) => containsKeyword(normalizedText, keyword));
 };
 
-export const hasInsultSignal = (normalizedText: string): boolean => {
-  return includesAny(normalizedText, INSULT_KEYWORDS);
-};
+export const hasInsultSignal = (normalizedText: string): boolean => {};
 
 export const hasPromptInjectionSignal = (normalizedText: string): boolean => {
killedBy: ChatMessageService input guardrail blocks insults and returns refusal without calling orchestrator
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"context": {"guideLevel": undefined, "location": undefined}, "history": [], "image": undefined, "knowledgeBaseBlock": "", "locale": "en", "museumMode": false, "requestId": "req-1", "text": "You are an idiot", "userMemoryBlock": "", "visitContext": undefined}

[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:104:78
   return includesAny(normalizedText, INSULT_KEYWORDS);
 };
 
-export const hasPromptInjectionSignal = (normalizedText: string): boolean => {
-  return includesAny(normalizedText, INJECTION_PATTERNS);
-};
+export const hasPromptInjectionSignal = (normalizedText: string): boolean => {};
 
 /**
killedBy: chat service orchestrator error handling triggers output guardrail on injection leak in orchestrator response
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:116:95
  * @param root0.text - User message text to evaluate.
  * @returns A guardrail decision indicating whether the message is allowed.
  */
-export const evaluateUserInputGuardrail = ({ text }: { text?: string }): GuardrailDecision => {
-  const normalizedText = normalize(text ?? '');
-  if (!normalizedText) return { allow: true };
-
-  if (hasInsultSignal(normalizedText)) return { allow: false, reason: 'insult' };
-  if (hasPromptInjectionSignal(normalizedText)) return { allow: false, reason: 'prompt_injection' };
-
-  return { allow: true };
-};
+export const evaluateUserInputGuardrail = ({ text }: { text?: string }): GuardrailDecision => {};
 
 /**
killedBy: ChatMessageService postMessage validates session ownership and calls orchestrator with correct params
statusReason: TypeError: Cannot read properties of undefined (reading 'allow')

[Timeout] LogicalOperator
modules/chat/application/art-topic-guardrail.ts:117:36
  * @returns A guardrail decision indicating whether the message is allowed.
  */
 export const evaluateUserInputGuardrail = ({ text }: { text?: string }): GuardrailDecision => {
-  const normalizedText = normalize(text ?? '');
+  const normalizedText = normalize(text && '');
   if (!normalizedText) return { allow: true };
 

[Timeout] StringLiteral
modules/chat/application/art-topic-guardrail.ts:117:44
  * @returns A guardrail decision indicating whether the message is allowed.
  */
 export const evaluateUserInputGuardrail = ({ text }: { text?: string }): GuardrailDecision => {
-  const normalizedText = normalize(text ?? '');
+  const normalizedText = normalize(text ?? "Stryker was here!");
   if (!normalizedText) return { allow: true };
 

[Killed] BooleanLiteral
modules/chat/application/art-topic-guardrail.ts:118:40
  */
 export const evaluateUserInputGuardrail = ({ text }: { text?: string }): GuardrailDecision => {
   const normalizedText = normalize(text ?? '');
-  if (!normalizedText) return { allow: true };
+  if (!normalizedText) return { allow: false };
 
   if (hasInsultSignal(normalizedText)) return { allow: false, reason: 'insult' };
killedBy: GuardrailEvaluationService evaluateInput allows empty or undefined text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
modules/chat/application/art-topic-guardrail.ts:118:7
  */
 export const evaluateUserInputGuardrail = ({ text }: { text?: string }): GuardrailDecision => {
   const normalizedText = normalize(text ?? '');
-  if (!normalizedText) return { allow: true };
+  if (normalizedText) return { allow: true };
 
   if (hasInsultSignal(normalizedText)) return { allow: false, reason: 'insult' };
killedBy: ChatMessageService input guardrail blocks insults and returns refusal without calling orchestrator
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"context": {"guideLevel": undefined, "location": undefined}, "history": [], "image": undefined, "knowledgeBaseBlock": "", "locale": "en", "museumMode": false, "requestId": "req-1", "text": "You are an idiot", "userMemoryBlock": "", "visitContext": undefined}

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:120:7
   const normalizedText = normalize(text ?? '');
   if (!normalizedText) return { allow: true };
 
-  if (hasInsultSignal(normalizedText)) return { allow: false, reason: 'insult' };
+  if (false) return { allow: false, reason: 'insult' };
   if (hasPromptInjectionSignal(normalizedText)) return { allow: false, reason: 'prompt_injection' };
 
killedBy: ChatMessageService input guardrail blocks insults and returns refusal without calling orchestrator
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: {"context": {"guideLevel": undefined, "location": undefined}, "history": [], "image": undefined, "knowledgeBaseBlock": "", "locale": "en", "museumMode": false, "requestId": "req-1", "text": "You are an idiot", "userMemoryBlock": "", "visitContext": undefined}

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:120:7
   const normalizedText = normalize(text ?? '');
   if (!normalizedText) return { allow: true };
 
-  if (hasInsultSignal(normalizedText)) return { allow: false, reason: 'insult' };
+  if (true) return { allow: false, reason: 'insult' };
   if (hasPromptInjectionSignal(normalizedText)) return { allow: false, reason: 'prompt_injection' };
 
killedBy: ChatMessageService postMessage validates session ownership and calls orchestrator with correct params
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
modules/chat/application/art-topic-guardrail.ts:121:65
   if (!normalizedText) return { allow: true };
 
   if (hasInsultSignal(normalizedText)) return { allow: false, reason: 'insult' };
-  if (hasPromptInjectionSignal(normalizedText)) return { allow: false, reason: 'prompt_injection' };
+  if (hasPromptInjectionSignal(normalizedText)) return { allow: true, reason: 'prompt_injection' };
 
   return { allow: true };
killedBy: ChatMessageService input guardrail blocks prompt injection attempts
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:121:7
   if (!normalizedText) return { allow: true };
 
   if (hasInsultSignal(normalizedText)) return { allow: false, reason: 'insult' };
-  if (hasPromptInjectionSignal(normalizedText)) return { allow: false, reason: 'prompt_injection' };
+  if (false) return { allow: false, reason: 'prompt_injection' };
 
   return { allow: true };
killedBy: GuardrailEvaluationService evaluateInput blocks text containing prompt injection attempts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:134:100
  * @param root0.text - Assistant response text to evaluate.
  * @returns A guardrail decision indicating whether the response is safe to return.
  */
-export const evaluateAssistantOutputGuardrail = ({ text }: { text: string }): GuardrailDecision => {
-  const normalizedText = normalize(text);
-  // 1. Empty -> block
-  if (!normalizedText) {
-    return { allow: false, reason: 'unsafe_output' };
-  }
-  // 2. Insult -> block
-  if (hasInsultSignal(normalizedText)) {
-    return { allow: false, reason: 'unsafe_output' };
-  }
-  // 3. Injection -> block
-  if (hasPromptInjectionSignal(normalizedText)) {
-    return { allow: false, reason: 'unsafe_output' };
-  }
-  // 4. Default -> allow
-  return { allow: true };
-};
+export const evaluateAssistantOutputGuardrail = ({ text }: { text: string }): GuardrailDecision => {};
 
 /**
killedBy: GuardrailEvaluationService evaluateOutput allows clean art-related output
statusReason: TypeError: Cannot read properties of undefined (reading 'allow')

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:137:7
 export const evaluateAssistantOutputGuardrail = ({ text }: { text: string }): GuardrailDecision => {
   const normalizedText = normalize(text);
   // 1. Empty -> block
-  if (!normalizedText) {
+  if (false) {
     return { allow: false, reason: 'unsafe_output' };
   }
killedBy: chat service orchestrator error handling triggers output guardrail on empty orchestrator response
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:137:7
 export const evaluateAssistantOutputGuardrail = ({ text }: { text: string }): GuardrailDecision => {
   const normalizedText = normalize(text);
   // 1. Empty -> block
-  if (!normalizedText) {
+  if (true) {
     return { allow: false, reason: 'unsafe_output' };
   }
killedBy: ChatMessageService output guardrail allows art-related LLM output through
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Monet"
Received string:    "I answer only about art, monuments, museums, architecture, and cultural heritage."

[Killed] BooleanLiteral
modules/chat/application/art-topic-guardrail.ts:138:21
   const normalizedText = normalize(text);
   // 1. Empty -> block
   if (!normalizedText) {
-    return { allow: false, reason: 'unsafe_output' };
+    return { allow: true, reason: 'unsafe_output' };
   }
   // 2. Insult -> block
killedBy: chat service orchestrator error handling triggers output guardrail on empty orchestrator response
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:141:40
     return { allow: false, reason: 'unsafe_output' };
   }
   // 2. Insult -> block
-  if (hasInsultSignal(normalizedText)) {
-    return { allow: false, reason: 'unsafe_output' };
-  }
+  if (hasInsultSignal(normalizedText)) {}
   // 3. Injection -> block
   if (hasPromptInjectionSignal(normalizedText)) {
killedBy: ChatMessageService output guardrail blocks unsafe LLM output and returns policy-cited refusal
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected substring: not "stupid"
Received string:        "You are a stupid idiot for asking that question"

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:141:7
     return { allow: false, reason: 'unsafe_output' };
   }
   // 2. Insult -> block
-  if (hasInsultSignal(normalizedText)) {
+  if (true) {
     return { allow: false, reason: 'unsafe_output' };
   }
killedBy: ChatMessageService output guardrail allows art-related LLM output through
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Monet"
Received string:    "I answer only about art, monuments, museums, architecture, and cultural heritage."

[Killed] BooleanLiteral
modules/chat/application/art-topic-guardrail.ts:142:21
   }
   // 2. Insult -> block
   if (hasInsultSignal(normalizedText)) {
-    return { allow: false, reason: 'unsafe_output' };
+    return { allow: true, reason: 'unsafe_output' };
   }
   // 3. Injection -> block
killedBy: chat service orchestrator error handling triggers output guardrail on insult in orchestrator response
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ObjectLiteral
modules/chat/application/art-topic-guardrail.ts:142:12
   }
   // 2. Insult -> block
   if (hasInsultSignal(normalizedText)) {
-    return { allow: false, reason: 'unsafe_output' };
+    return {};
   }
   // 3. Injection -> block
killedBy: ChatMessageService output guardrail blocks unsafe LLM output and returns policy-cited refusal
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:145:7
     return { allow: false, reason: 'unsafe_output' };
   }
   // 3. Injection -> block
-  if (hasPromptInjectionSignal(normalizedText)) {
+  if (true) {
     return { allow: false, reason: 'unsafe_output' };
   }
killedBy: chat service orchestrator error handling returns fallback text when model is null
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "running without an LLM key"
Received string:    "I answer only about art, monuments, museums, architecture, and cultural heritage."

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:145:7
     return { allow: false, reason: 'unsafe_output' };
   }
   // 3. Injection -> block
-  if (hasPromptInjectionSignal(normalizedText)) {
+  if (false) {
     return { allow: false, reason: 'unsafe_output' };
   }
killedBy: chat service orchestrator error handling triggers output guardrail on injection leak in orchestrator response
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BooleanLiteral
modules/chat/application/art-topic-guardrail.ts:146:21
   }
   // 3. Injection -> block
   if (hasPromptInjectionSignal(normalizedText)) {
-    return { allow: false, reason: 'unsafe_output' };
+    return { allow: true, reason: 'unsafe_output' };
   }
   // 4. Default -> allow
killedBy: GuardrailEvaluationService evaluateOutput blocks output containing injection leak patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
modules/chat/application/art-topic-guardrail.ts:149:19
     return { allow: false, reason: 'unsafe_output' };
   }
   // 4. Default -> allow
-  return { allow: true };
+  return { allow: false };
 };
 
killedBy: chat service orchestrator error handling returns fallback text when model is null
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "running without an LLM key"
Received string:    "I answer only about art, monuments, museums, architecture, and cultural heritage."

[Killed] ObjectLiteral
modules/chat/application/art-topic-guardrail.ts:149:10
     return { allow: false, reason: 'unsafe_output' };
   }
   // 4. Default -> allow
-  return { allow: true };
+  return {};
 };
 
killedBy: ChatMessageService output guardrail allows art-related LLM output through
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Monet"
Received string:    "I answer only about art, monuments, museums, architecture, and cultural heritage."
