[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:163:14
 export const buildGuardrailRefusal = (
   locale: string | undefined,
   reason?: GuardrailBlockReason,
-): string => {
-  const resolved = resolveLocale([locale]);
-  const messages = GUARDRAIL_REFUSALS[resolved];
-
-  if (reason === 'insult') return messages.insult;
-  return messages.default;
-};
+): string => {};
 
 /**
killedBy: GuardrailEvaluationService handleInputBlock persists a refusal message and returns the expected structure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: "undefined"

[Killed] ArrayDeclaration
modules/chat/application/art-topic-guardrail.ts:164:34
   locale: string | undefined,
   reason?: GuardrailBlockReason,
 ): string => {
-  const resolved = resolveLocale([locale]);
+  const resolved = resolveLocale([]);
   const messages = GUARDRAIL_REFUSALS[resolved];
 
killedBy: buildGuardrailRefusal returns FR insult refusal
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "insultes"
Received string:    "I cannot process insulting language. I can only help with art, monuments, museums, and cultural heritage."

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:167:7
   const resolved = resolveLocale([locale]);
   const messages = GUARDRAIL_REFUSALS[resolved];
 
-  if (reason === 'insult') return messages.insult;
+  if (false) return messages.insult;
   return messages.default;
 };
killedBy: buildGuardrailRefusal returns FR insult refusal
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "insultes"
Received string:    "Je réponds uniquement sur l'art, les monuments, les musées, l'architecture et le patrimoine culturel."

[Killed] ConditionalExpression
modules/chat/application/art-topic-guardrail.ts:167:7
   const resolved = resolveLocale([locale]);
   const messages = GUARDRAIL_REFUSALS[resolved];
 
-  if (reason === 'insult') return messages.insult;
+  if (true) return messages.insult;
   return messages.default;
 };
killedBy: buildGuardrailRefusal returns EN generic refusal for off_topic
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "only about art"
Received string:    "I cannot process insulting language. I can only help with art, monuments, museums, and cultural heritage."

[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:177:94
  * @param reason - The guardrail block reason.
  * @returns A citation string, or undefined when no reason is provided.
  */
-export const buildGuardrailCitation = (reason?: GuardrailBlockReason): string | undefined => {
-  if (!reason) {
-    return undefined;
-  }
-
-  return `policy:${reason}`;
-};
+export const buildGuardrailCitation = (reason?: GuardrailBlockReason): string | undefined => {};
 
killedBy: buildGuardrailCitation returns policy citation for each block reason
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "policy:insult"
Received: undefined

[Killed] BlockStatement
modules/chat/application/art-topic-guardrail.ts:178:16
  * @returns A citation string, or undefined when no reason is provided.
  */
 export const buildGuardrailCitation = (reason?: GuardrailBlockReason): string | undefined => {
-  if (!reason) {
-    return undefined;
-  }
+  if (!reason) {}
 
   return `policy:${reason}`;
killedBy: GuardrailEvaluationService handleInputBlock handles undefined reason with default refusal and no policy citation
statusReason: Error: expect(received).toBeUndefined()

Received: ["policy:undefined"]

[Killed] BooleanLiteral
modules/chat/application/art-topic-guardrail.ts:178:7
  * @returns A citation string, or undefined when no reason is provided.
  */
 export const buildGuardrailCitation = (reason?: GuardrailBlockReason): string | undefined => {
-  if (!reason) {
+  if (reason) {
     return undefined;
   }
killedBy: buildGuardrailCitation returns policy citation for each block reason
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "policy:insult"
Received: undefined

[Killed] StringLiteral
modules/chat/application/art-topic-guardrail.ts:182:10
     return undefined;
   }
 
-  return `policy:${reason}`;
+  return ``;
 };
 
killedBy: GuardrailEvaluationService handleInputBlock includes policy citation in metadata for insult reason
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined
